Powerlated/FEH_Robot_Team_C2/Startup/startup_mk60d10.cpp
        // set kill pin low for power shutdown
        SD.FCloseAll();
        GPIOD_PDOR &= ~GPIO_PDOR_PDO( GPIO_PIN( 13 ) );
    }
}

#ifdef MCU_MK60N512VMD100
#define BSP_CLOCK_SRC                   (50000000ul)       // crystal, oscillator freq
#else
#define BSP_CLOCK_SRC                   (8000000ul)       // crystal, oscillator freq
#endif
#define BSP_REF_CLOCK_SRC               (2000000ul)       // must be 2-4MHz

#define BSP_CORE_DIV                    (1)
#define BSP_BUS_DIV                     (2)
#define BSP_FLEXBUS_DIV                 (2)
#define BSP_FLASH_DIV                   (4)
#define BSP_CLOCK_MUL                   (44)    /* 48MHz */

#define BSP_REF_CLOCK_DIV               (BSP_CLOCK_SRC / BSP_REF_CLOCK_SRC)

#define MCU_MK60N512VMD100


#define USE_88_MHZ_CLOCK

void InitPowerButton()
{
    //tVectorTable* vect_table;

    // Power button kill pin = D13
    PORT_PCR_REG( PORTD_BASE_PTR, 13 ) = ( 0 | PORT_PCR_MUX( 1 ) );
    GPIOD_PDDR |= GPIO_PDDR_PDD( GPIO_PIN( 13 ) );

    // Set kill pin high to keep the push button controller active
    GPIOD_PDOR |= GPIO_PDOR_PDO( GPIO_PIN( 13 ) );

    // Power button interrupt pin = D12
    // pull up and falling edge interrupt
    PORT_PCR_REG( PORTD_BASE_PTR, 12 ) = ( 0 | PORT_PCR_MUX( 1 ) | PORT_PCR_IRQC( 0xA ) | PORT_PCR_PE_MASK | PORT_PCR_PS_MASK );

    // enable interrupt on port D
    //enable_irq( 90 );
    NVICICPR2 |= 1 << ( 26 );
    NVICISER2 |= 1 << ( 26 );

    //#define VECTOR_106      default_isr     // 0x0000_01A8 106   90     Port control module Pin Detect (Port D)
    //vect_table = (tVectorTable*)SCB_VTOR;
    //vect_table->__fun[ 106 ] = PortDISR;
}

/*****************************************************************************
* It will configure the MCU to disable STOP and COP Modules.
* It also set the MCG configuration and bus clock frequency.
****************************************************************************/
static unsigned char pll_init_bl()
{
   /*This assumes that the MCG is in default FEI mode out of reset. */

   /* First move to FBE mode */
#ifdef MCU_MK60N512VMD100
   /* Enable external oscillator, RANGE=0, HGO=, EREFS=, LP=, IRCS= */
   MCG_C2 = 0;
#else
   /* Enable external oscillator, RANGE=2, HGO=1, EREFS=1, LP=0, IRCS=0 */
   MCG_C2 = MCG_C2_RANGE(2) | MCG_C2_HGO_MASK | MCG_C2_EREFS_MASK|MCG_C2_IRCS_MASK;
#endif

   /* Select external oscilator and Reference Divider and clear IREFS to start ext osc
	  CLKS=2, FRDIV=3, IREFS=0, IRCLKEN=0, IREFSTEN=0 */
   MCG_C1 = MCG_C1_CLKS(2) | MCG_C1_FRDIV(3);

#ifndef MCU_MK60N512VMD100
   /* wait for oscillator to initialize */
  while (!(MCG_S & MCG_S_OSCINIT_MASK)){};
#endif

  /* wait for Reference clock Status bit to clear */
   while (MCG_S & MCG_S_IREFST_MASK){};

   while (((MCG_S & MCG_S_CLKST_MASK) >> MCG_S_CLKST_SHIFT) != 0x2){}; /* Wait for clock status bits to show clock source is ext ref clk */

#ifdef MCU_MK60N512VMD100
   MCG_C5 = MCG_C5_PRDIV(BSP_REF_CLOCK_DIV - 1);
#else
   MCG_C5 = MCG_C5_PRDIV(BSP_REF_CLOCK_DIV - 1) | MCG_C5_PLLCLKEN_MASK;
#endif
   /* Ensure MCG_C6 is at the reset default of 0. LOLIE disabled,
	PLL enabled, clk monitor disabled, PLL VCO divider is clear */
   MCG_C6 = 0;

   /* Set system options dividers */

   SIM_CLKDIV1 =   SIM_CLKDIV1_OUTDIV1(BSP_CORE_DIV - 1) | 	/* core/system clock */
				   SIM_CLKDIV1_OUTDIV2(BSP_BUS_DIV - 1)  | 	/* peripheral clock; */
				   SIM_CLKDIV1_OUTDIV3(BSP_FLEXBUS_DIV - 1) |  /* FlexBus clock driven to the external pin (FB_CLK)*/
				   SIM_CLKDIV1_OUTDIV4(BSP_FLASH_DIV - 1);     /* flash clock */

   /* Set the VCO divider and enable the PLL, LOLIE = 0, PLLS = 1, CME = 0, VDIV = */
   //MCG_C6 = MCG_C6_PLLS_MASK | MCG_C6_VDIV(BSP_CLOCK_MUL - 24); /* 2MHz * BSP_CLOCK_MUL */
   MCG_C6 = MCG_C6_PLLS_MASK | MCG_C6_VDIV(BSP_CLOCK_MUL - 24); /* 2MHz * BSP_CLOCK_MUL */

   while (!(MCG_S & MCG_S_PLLST_MASK)){}; /* wait for PLL status bit to set */
   while (!(MCG_S & MCG_S_LOCK_MASK)){}; /* Wait for LOCK bit to set */

   /* Transition into PEE by setting CLKS to 0
   CLKS=0, FRDIV=3, IREFS=0, IRCLKEN=0, IREFSTEN=0 */
   MCG_C1 &= ~MCG_C1_CLKS_MASK;

   /* Wait for clock status bits to update */
   while (((MCG_S & MCG_S_CLKST_MASK) >> MCG_S_CLKST_SHIFT) != 0x3){};

   return 0;
}

void InitFEHProteus()
{
	// Initialize GPIO Clocks
	SIM_SCGC5 |= (SIM_SCGC5_PORTA_MASK | SIM_SCGC5_PORTB_MASK | SIM_SCGC5_PORTC_MASK | SIM_SCGC5_PORTD_MASK | SIM_SCGC5_PORTE_MASK );

	InitPowerButton();

	// Setup clocks
#ifndef USE_88_MHZ_CLOCK
	CoreClockMHz = pll_init( CORE_CLK_MHZ, REF_CLK );
#else
	pll_init_bl();
	CoreClockMHz = BSP_CLOCK_MUL * 2;
#endif
	CoreClockKHz = CoreClockMHz * 1000;
	PeripheralClockKHz = CoreClockKHz / ( ( ( SIM_CLKDIV1 & SIM_CLKDIV1_OUTDIV2_MASK ) >> 24 ) + 1 );

	// Initialize ADC and PIT Clocks
	SIM_SCGC6 |= (SIM_SCGC6_ADC0_MASK | SIM_SCGC6_PIT_MASK | SIM_SCGC6_RTC_MASK);
	SIM_SCGC3 |= (SIM_SCGC3_ADC1_MASK );

	// Turn on Real Time Clock Oscillator
	RTC_CR = RTC_CR_OSCE_MASK;
	// Wait for it to come online
	// Use time_delay_ms (which uses the Low power timer) since Sleep needs the RTC
	time_delay_ms(100);
	
	// Enable Real Time Clock
	RTC_SR &=  ~RTC_SR_TCE_MASK;
	RTC_TSR = 0x0u;
	RTC_SR =  RTC_SR_TCE_MASK;
	
	// Initialize LCD
	LCD.Initialize();

	// Initialize ADCs
	AnalogInputPin::InitADCs();
	AnalogEncoder::Init();

	Propeller.Initialize();
	
	Random.Initialize();
	
    Sleep(2000);
}

//*****************************************************************************
// The vector table.
// This relies on the linker script to place at correct location in memory.
//*****************************************************************************
extern void (* const g_pfnVectors[])(void);
extern void * __Vectors __attribute__ ((alias ("g_pfnVectors")));

__attribute__ ((used, section(".isr_vector")))
void (* const g_pfnVectors[])(void) = {
    // Core Level - CM4
    &_vStackTop,                       // The initial stack pointer
    ResetISR,                          // The reset handler
    NMI_Handler,                       // The NMI handler
    HardFault_Handler,                 // The hard fault handler
    MemManage_Handler,                 // The MPU fault handler
    BusFault_Handler,                  // The bus fault handler
    UsageFault_Handler,                // The usage fault handler
    0,                                 // Reserved
    0,                                 // Reserved
    0,                                 // Reserved
    0,                                 // Reserved
    SVC_Handler,                       // SVCall handler
    DebugMon_Handler,                  // Debug monitor handler
    0,                                 // Reserved
    PendSV_Handler,                    // The PendSV handler
    SysTick_Handler,                   // The SysTick handler

    // Chip Level - MK60D10
    DMA0_IRQHandler,                      // 16 : DMA channel 0 transfer complete
    DMA1_IRQHandler,                      // 17 : DMA channel 1 transfer complete
    DMA2_IRQHandler,                      // 18 : DMA channel 2 transfer complete
    DMA3_IRQHandler,                      // 19 : DMA channel 3 transfer complete
    DMA4_IRQHandler,                      // 20 : DMA channel 4 transfer complete
    DMA5_IRQHandler,                      // 21 : DMA channel 5 transfer complete
    DMA6_IRQHandler,                      // 22 : DMA channel 6 transfer complete
    DMA7_IRQHandler,                      // 23 : DMA channel 7 transfer complete
    DMA8_IRQHandler,                      // 24 : DMA channel 8 transfer complete
    DMA9_IRQHandler,                      // 25 : DMA channel 9 transfer complete
    DMA10_IRQHandler,                     // 26 : DMA channel 10 transfer complete
    DMA11_IRQHandler,                     // 27 : DMA channel 11 transfer complete
    DMA12_IRQHandler,                     // 28 : DMA channel 12 transfer complete
    DMA13_IRQHandler,                     // 29 : DMA channel 13 transfer complete
    DMA14_IRQHandler,                     // 30 : DMA channel 14 transfer complete
    DMA15_IRQHandler,                     // 31 : DMA channel 15 transfer complete
    DMA_Error_IRQHandler,                 // 32 : DMA channel 0 - 15 error
    MCM_IRQHandler,                       // 33 : MCM normal interrupt
    FTFL_IRQHandler,                      // 34 : FTFL command complete
    Read_Collision_IRQHandler,            // 35 : FTFL read collision
    LVD_LVW_IRQHandler,                   // 36 : PMC controller low-voltage detect, low-voltage warning
    LLWU_IRQHandler,                      // 37 : Low leakage wakeup
    WDOG_EWM_IRQHandler,                  // 38 : Single interrupt vector for  WDOG and EWM
    RNG_IRQHandler,                       // 39 : Randon number generator
    I2C0_IRQHandler,                      // 40 : Inter-integrated circuit 0
    I2C1_IRQHandler,                      // 41 : Inter-integrated circuit 1
    SPI0_IRQHandler,                      // 42 : Serial peripheral Interface 0
    SPI1_IRQHandler,                      // 43 : Serial peripheral Interface 1
    SPI2_IRQHandler,                      // 44 : Serial peripheral Interface 1
    CAN0_ORed_Message_buffer_IRQHandler,  // 45 : CAN0 ORed message buffers
    CAN0_Bus_Off_IRQHandler,              // 46 : CAN0 bus off
    CAN0_Error_IRQHandler,                // 47 : CAN0 error
    CAN0_Tx_Warning_IRQHandler,           // 48 : CAN0 Tx warning
    CAN0_Rx_Warning_IRQHandler,           // 49 : CAN0 Rx warning
    CAN0_Wake_Up_IRQHandler,              // 50 : CAN0 wake up
    I2S0_Tx_IRQHandler,                   // 51 : Integrated interchip sound 0 transmit interrupt
    I2S0_Rx_IRQHandler,                   // 52 : Integrated interchip sound 0 receive interrupt
    CAN1_ORed_Message_buffer_IRQHandler,  // 53 : CAN1 OR'd message buffers interrupt
    CAN1_Bus_Off_IRQHandler,              // 54 : CAN1 bus off interrupt
    CAN1_Error_IRQHandler,                // 55 : CAN1 error interrupt
    CAN1_Tx_Warning_IRQHandler,           // 56 : CAN1 Tx warning interrupt
    CAN1_Rx_Warning_IRQHandler,           // 57 : CAN1 Rx warning interrupt
    CAN1_Wake_Up_IRQHandler,              // 58 : CAN1 wake up interrupt
    Reserved59_IRQHandler,                // 59 : Reserved interrupt
    UART0_LON_IRQHandler,                 // 60 : UART0 LON
    UART0_RX_TX_IRQHandler,               // 61 : UART0 receive/transmit interrupt
    UART0_ERR_IRQHandler,                 // 62 : UART0 error interrupt
    UART1_RX_TX_IRQHandler,               // 63 : UART1 receive/transmit interrupt
    UART1_ERR_IRQHandler,                 // 64 : UART1 error interrupt
    UART2_RX_TX_IRQHandler,               // 65 : UART2 receive/transmit interrupt
    UART2_ERR_IRQHandler,                 // 66 : UART2 error interrupt
    UART3_RX_TX_IRQHandler,               // 67 : UART3 receive/transmit interrupt
    UART3_ERR_IRQHandler,                 // 68 : UART3 error interrupt
    UART4_RX_TX_IRQHandler,               // 69 : UART4 receive/transmit interrupt
    UART4_ERR_IRQHandler,                 // 70 : UART4 error interrupt
    UART5_RX_TX_IRQHandler,               // 71 : UART5 receive/transmit interrupt
    UART5_ERR_IRQHandler,                 // 72 : UART5 error interrupt
    ADC0_IRQHandler,                      // 73 : Analog-to-digital converter 0
    ADC1_IRQHandler,                      // 74 : Analog-to-digital converter 1
    CMP0_IRQHandler,                      // 75 : Comparator 0
    CMP1_IRQHandler,                      // 76 : Comparator 1
    CMP2_IRQHandler,                      // 77 : Comparator 2
    FTM0_IRQHandler,                      // 78 : FlexTimer module 0 fault, overflow and channels interrupt
    FTM1_IRQHandler,                      // 79 : FlexTimer module 1 fault, overflow and channels interrupt
    FTM2_IRQHandler,                      // 80 : FlexTimer module 2 fault, overflow and channels interrupt
    CMT_IRQHandler,                       // 81 : Carrier modulator transmitter
    RTC_IRQHandler,                       // 82 : Real time clock
    RTC_Seconds_IRQHandler,               // 83 : Real time clock seconds
    PIT0_IRQHandler,                      // 84 : Periodic interrupt timer channel 0
    PIT1_IRQHandler,                      // 85 : Periodic interrupt timer channel 1
    PIT2_IRQHandler,                      // 86 : Periodic interrupt timer channel 2
    PIT3_IRQHandler,                      // 87 : Periodic interrupt timer channel 3
    PDB0_IRQHandler,                      // 88 : Programmable delay block
    USB0_IRQHandler,                      // 89 : USB OTG interrupt
    USBDCD_IRQHandler,                    // 90 : USB charger detect
    ENET_1588_Timer_IRQHandler,           // 91 : Ethernet MAC IEEE 1588 timer
    ENET_Transmit_IRQHandler,             // 92 : Ethernet MAC transmit
    ENET_Receive_IRQHandler,              // 93 : Ethernet MAC receive
    ENET_Error_IRQHandler,                // 94 : Ethernet MAC error and miscelaneous
    Reserved95_IRQHandler,                // 95 : Reserved interrupt
    SDHC_IRQHandler,                      // 96 : Secured digital host controller
    DAC0_IRQHandler,                      // 97 : Digital-to-analog converter 0
    DAC1_IRQHandler,                      // 98 : Digital-to-analog converter 1
    TSI0_IRQHandler,                      // 99 : TSI0 Interrupt
    MCG_IRQHandler,                       // 100: Multipurpose clock generator
    LPTMR0_IRQHandler,                    // 101: Low power timer interrupt
    Reserved102_IRQHandler,               // 102: Reserved interrupt
    PORTA_IRQHandler,                     // 103: Port A interrupt
    PORTB_IRQHandler,                     // 104: Port B interrupt
    PORTC_IRQHandler,                     // 105: Port C interrupt
    PORTD_IRQHandler,                     // 106: Port D interrupt
    PORTE_IRQHandler,                     // 107: Port E interrupt
    Reserved108_IRQHandler,               // 108: Reserved interrupt
    Reserved109_IRQHandler,               // 109: Reserved interrupt
    SWI_IRQHandler,                       // 110: Software interrupt
}; /* End of g_pfnVectors */

//*****************************************************************************
// Functions to carry out the initialization of RW and BSS data sections. These
// are written as separate functions rather than being inlined within the
// ResetISR() function in order to cope with MCUs with multiple banks of
// memory.
//*****************************************************************************
__attribute__ ((section(".after_vectors.init_data")))
void data_init(unsigned int romstart, unsigned int start, unsigned int len) {
	unsigned int *pulDest = (unsigned int*) start;
	unsigned int *pulSrc = (unsigned int*) romstart;
	unsigned int loop;
	for (loop = 0; loop < len; loop = loop + 4)
		*pulDest++ = *pulSrc++;
}

__attribute__ ((section(".after_vectors.init_bss")))
void bss_init(unsigned int start, unsigned int len) {
	unsigned int *pulDest = (unsigned int*) start;
	unsigned int loop;
	for (loop = 0; loop < len; loop = loop + 4)
		*pulDest++ = 0;
}

//*****************************************************************************
// The following symbols are constructs generated by the linker, indicating
// the location of various points in the "Global Section Table". This table is
// created by the linker via the Code Red managed linker script mechanism. It
// contains the load address, execution address and length of each RW data
// section and the execution and length of each BSS (zero initialized) section.
//*****************************************************************************
extern unsigned int __data_section_table;
extern unsigned int __data_section_table_end;
extern unsigned int __bss_section_table;
extern unsigned int __bss_section_table_end;

//*****************************************************************************
// Reset entry point for your code.
// Sets up a simple runtime environment and initializes the C/C++
// library.
//*****************************************************************************
__attribute__ ((section(".after_vectors.reset")))
void ResetISR(void) {

    // Disable interrupts
    __asm volatile ("cpsid i");

#if defined (__USE_CMSIS)
// If __USE_CMSIS defined, then call CMSIS SystemInit code
    SystemInit();
#else
    // Disable Watchdog
    //  Write 0xC520 to watchdog unlock register
    *((volatile unsigned short *)0x4005200E) = 0xC520;
    //  Followed by 0xD928 to complete the unlock
    *((volatile unsigned short *)0x4005200E) = 0xD928;
    // Now disable watchdog via STCTRLH register
    *((volatile unsigned short *)0x40052000) = 0x01D2u;
#endif // (__USE_CMSIS)

    //
    // Copy the data sections from flash to SRAM.
    //
	unsigned int LoadAddr, ExeAddr, SectionLen;
	unsigned int *SectionTableAddr;

